waveshareteam/ESP32-C6-Touch-LCD-2.8/example/ESP-IDF-V554/08_bookesia/components/esp32_c6_touch_lcd_2_8/esp32_c6_touch_lcd_2.8.c
    es8311_codec_cfg_t es8311_cfg = {
        .ctrl_if = i2c_ctrl_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_DAC,
        .pa_pin = BSP_POWER_AMP_IO,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = false,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
    };
    const audio_codec_if_t *es8311_dev = es8311_codec_new(&es8311_cfg);
    BSP_NULL_CHECK(es8311_dev, NULL);

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .codec_if = es8311_dev,
        .data_if = i2s_data_if,
    };
    return esp_codec_dev_new(&codec_dev_cfg);
} 


/**************************************************************************************************
 * sensor init
 **************************************************************************************************/

 pcf85063a_datetime_t Set_Time = {
    .year = 2026, .month = 02, .day = 02, .dotw = 1,
    .hour = 23, .min = 59, .sec = 0
};

esp_err_t qmi_init()
{
    i2c_master_bus_handle_t bus_handle = bsp_i2c_get_handle();
    if (!bus_handle) return ESP_FAIL;
    esp_err_t ret = qmi8658_init(&qmi_dev, bus_handle, QMI8658_ADDRESS_HIGH);
    if (ret != ESP_OK) return ret;

    qmi8658_set_accel_range(&qmi_dev, QMI8658_ACCEL_RANGE_8G);
    qmi8658_set_accel_odr(&qmi_dev, QMI8658_ACCEL_ODR_500HZ);
    qmi8658_set_accel_unit_mps2(&qmi_dev, true);
    qmi8658_set_gyro_unit_rads(&qmi_dev, true);
    qmi8658_write_register(&qmi_dev, QMI8658_CTRL5, 0x03);
    ESP_LOGI(TAG, "qmi8658 init success");
    return ESP_OK;
}

esp_err_t pcf_init()
{
    i2c_master_bus_handle_t bus_handle = bsp_i2c_get_handle();
    esp_err_t ret = pcf85063a_init(&pcf_dev, bus_handle, PCF85063A_ADDRESS);
    if (ret != ESP_OK) return ret;
    pcf85063a_set_time_date(&pcf_dev, Set_Time);
    ESP_LOGI(TAG, "pcf85063a init success");
    return ESP_OK;
}

esp_err_t shtc3_init(void)
{
    i2c_master_bus_handle_t bus_handle = bsp_i2c_get_handle();
    if (!bus_handle) return ESP_FAIL;

    shtc3_handle = shtc3_device_create(bus_handle, SHTC3_I2C_ADDR, 400000);
    if (!shtc3_handle) return ESP_FAIL;

    esp_err_t err = i2c_master_probe(bus_handle, SHTC3_I2C_ADDR, 200);
    if (err == ESP_OK) {
        uint8_t sensor_id[2];
        shtc3_get_id(shtc3_handle, sensor_id);
        ESP_LOGI(TAG, "SHTC3 ID: 0x%02x%02x", sensor_id[0], sensor_id[1]);
        return ESP_OK;
    }
    return ESP_FAIL;
}

/**************************************************************************************************
 * bk init
 **************************************************************************************************/
static uint8_t brightness = 100;  // 默认亮度100%

esp_err_t bsp_display_brightness_init(void)
{
    return bsp_io_expander_init();
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    if (brightness_percent > 100) brightness_percent = 100;
    if (brightness_percent < 0) brightness_percent = 0;

    if (io_expander == NULL) {
        ESP_LOGE(TAG, "Backlight PWM skipped: IO expander is not initialized");
        return ESP_ERR_INVALID_STATE;
    }

    brightness = (uint8_t)brightness_percent;

    uint8_t pwm_value = (brightness_percent * 255) / 100;
    ESP_LOGI(TAG, "Backlight request: %d%% -> PWM=%u, expander=%p",
             brightness_percent, pwm_value, io_expander);

    esp_err_t ret = custom_io_expander_set_pwm(io_expander, pwm_value);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Backlight PWM write failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ESP_LOGI(TAG, "Backlight PWM write succeeded: PWM=%u", pwm_value);
    return ESP_OK;
}

int bsp_display_brightness_get(void)
{
    return (int)brightness;
}

esp_err_t bsp_display_backlight_off(void)
{
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_backlight_on(void)
{
    return bsp_display_brightness_set(100);
}


/**************************************************************************************************
 * lcd init
 **************************************************************************************************/
void lcd_fill_screen(esp_lcd_panel_handle_t panel_handle, uint16_t color)
{
    uint32_t pixel_count = BSP_LCD_H_RES * BSP_LCD_V_RES;
    uint8_t *color_buf = heap_caps_malloc(pixel_count * 2, MALLOC_CAP_DMA);
    if (!color_buf) {
        ESP_LOGE("LCD", "malloc failed");
        return;
    }
    uint8_t color_high = (color >> 8) & 0xFF;
    uint8_t color_low = color & 0xFF;
    for (uint32_t i = 0; i < pixel_count; i++) {
        color_buf[i * 2] = color_high;
        color_buf[i * 2 + 1] = color_low;
    }
    esp_lcd_panel_draw_bitmap(panel_handle, 0, 0, BSP_LCD_H_RES, BSP_LCD_V_RES, (uint16_t *)color_buf);
    free(color_buf);
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel, esp_lcd_panel_io_handle_t *ret_io)
{
    BSP_ERROR_CHECK_RETURN_ERR(bsp_io_expander_init());

    esp_io_expander_set_level(io_expander, IO_LCD_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(200));
    esp_io_expander_set_level(io_expander, IO_LCD_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(200));

    esp_err_t ret = ESP_OK;
    if(!spi_sd_initialized) bsp_spi_init();
    spi_sd_initialized = true;

    const esp_lcd_panel_io_spi_config_t io_config = {
        .dc_gpio_num = BSP_LCD_DC,
        .cs_gpio_num = BSP_LCD_CS,
        .pclk_hz = 20 * 1000 * 1000,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .spi_mode = 0,
        .trans_queue_depth = 10,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)BSP_LCD_SPI_NUM, &io_config, &io_handle));

    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        // .data_endian = LCD_RGB_DATA_ENDIAN_LITTLE,
    };

    ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(io_handle, &panel_config, &panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle, true));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));

    if (ret_panel) *ret_panel = panel_handle;
    if (ret_io) *ret_io = io_handle;

    return ret;
}

