waveshareteam/ESP32-C6-Touch-LCD-2.8/example/ESP-IDF-V554/08_bookesia/components/esp32_c6_touch_lcd_2_8/esp32_c6_touch_lcd_2.8.c
/**************************************************************************************************
 * touch init
 **************************************************************************************************/
esp_err_t bsp_touch_new(const bsp_display_cfg_t *cfg, esp_lcd_touch_handle_t *ret_touch)
{
    esp_log_level_set("i2c.master", ESP_LOG_NONE);
    esp_log_level_set("i2c.common", ESP_LOG_NONE);

    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    BSP_ERROR_CHECK_RETURN_ERR(bsp_io_expander_init());

    esp_io_expander_set_level(io_expander, IO_LCD_TOUCH_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(50));
    esp_io_expander_set_level(io_expander, IO_LCD_TOUCH_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(200));

    const esp_lcd_touch_config_t tp_cfg = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = BSP_LCD_TOUCH_RST,
        .int_gpio_num = BSP_LCD_TOUCH_INT,
        .levels = {.reset = 0, .interrupt = 0},
        .flags = {
            .swap_xy = cfg->touch_flags.swap_xy,
            .mirror_x = cfg->touch_flags.mirror_x,
            .mirror_y = cfg->touch_flags.mirror_y,
        },
    };

    esp_lcd_panel_io_handle_t tp_io_handle = NULL;
    esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_CST3530_CONFIG();
    tp_io_config.scl_speed_hz = 400000;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle), TAG, "");

    return esp_lcd_touch_new_i2c_cst3530(tp_io_handle, &tp_cfg, ret_touch);
}

/**************************************************************************************************
 * LVGL init
 **************************************************************************************************/
static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *cfg)
{
    assert(cfg != NULL);
    bsp_display_config_t disp_config = {0};
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&disp_config, &panel_handle, &io_handle));

    esp_lv_adapter_display_config_t disp_cfg =
        ESP_LV_ADAPTER_DISPLAY_SPI_WITHOUT_PSRAM_DEFAULT_CONFIG(
            panel_handle,
            io_handle,
            BSP_LCD_H_RES,
            BSP_LCD_V_RES,
            cfg->rotation);

    disp_cfg.profile.buffer_height = LVGL_BUFFER_HEIGHT;
    disp_cfg.profile.require_double_buffer = false;
    disp_cfg.tear_avoid_mode = cfg->tear_avoid_mode;

    ESP_LOGI(TAG, "LVGL SPI draw buffer: %dx%d, double=%d, psram=%d, free internal=%u",
             BSP_LCD_H_RES,
             disp_cfg.profile.buffer_height,
             disp_cfg.profile.require_double_buffer,
             disp_cfg.profile.use_psram,
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));

    lv_display_t *disp = esp_lv_adapter_register_display(&disp_cfg);
    if (disp == NULL) {
        ESP_LOGE(TAG, "Failed to register LVGL display, free internal=%u",
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    }
    return disp;
}

static lv_indev_t *bsp_display_indev_init(const bsp_display_cfg_t *cfg, lv_display_t *disp)
{
    assert(cfg != NULL);
    esp_err_t ret = bsp_touch_new(cfg, &tp);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Touch init failed: %s. Continue without touch input", esp_err_to_name(ret));
        return NULL;
    }

    const esp_lv_adapter_touch_config_t touch_cfg = ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(disp, tp);
    lv_indev_t *indev = esp_lv_adapter_register_touch(&touch_cfg);
    if (indev == NULL) {
        ESP_LOGW(TAG, "Touch registration failed. Continue without touch input");
    }
    return indev;
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t cfg = {
        .lv_adapter_cfg = ESP_LV_ADAPTER_DEFAULT_CONFIG(),
        .rotation = ESP_LV_ADAPTER_ROTATE_0,
        .tear_avoid_mode = ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE,
        .touch_flags = {.swap_xy = 0, .mirror_x = 0, .mirror_y = 0}
    };
    return bsp_display_start_with_config(&cfg);
}

lv_display_t *bsp_display_start_with_config(bsp_display_cfg_t *cfg)
{
    assert(cfg != NULL);
    BSP_ERROR_CHECK_RETURN_NULL(esp_lv_adapter_init(&cfg->lv_adapter_cfg));

    lv_display_t *disp = bsp_display_lcd_init(cfg);
    BSP_NULL_CHECK(disp, NULL);

    disp_indev = bsp_display_indev_init(cfg, disp);
    if (disp_indev == NULL) {
        ESP_LOGW(TAG, "Touch input registration failed, continue with display only");
    }

    BSP_ERROR_CHECK_RETURN_NULL(bsp_io_expander_init());
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_brightness_init());

    BSP_ERROR_CHECK_RETURN_NULL(esp_lv_adapter_start());
    disp_drv = disp;
    return disp;
}

lv_display_t *bsp_display_get_disp_dev(void)
{
    return disp_drv;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

esp_err_t bsp_display_lock(uint32_t timeout_ms)
{
    return esp_lv_adapter_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    esp_lv_adapter_unlock();
}
